"""
Дан набор из N целых положительных чисел.

Необходимо определить,
с какой цифры реже всего начинается десятичная запись чисел этого набора.
В выводе укажите количество чисел,
у которых первая цифра встречается реже всего.

Описание входных и выходных данных

Даны два входных файла (файл A и файл B),
каждый из которых содержит в первой строке входных данных количество чисел
N (1 ≤ N ≤ 10 000).
В каждой из последующих N строк записано одно натуральное число,
не превышающее 100 000.

Пример входных данных:
5
35
417
225
32
4801

Пример выходных данных для приведённого выше примера входных данных: 1

Предупреждение: для обработки файла B не следует использовать
переборный алгоритм, вычисляющий сумму для всех возможных вариантов,
поскольку написанная по такому алгоритму программа
будет выполняться слишком долго.
"""
