"""
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит
куча камней. Игроки ходят по очереди, первый ход делает Петя. За один
ход игрок может

а) забрать из кучи один камень;
б) забрать из кучи два камня;
в) забрать из кучи четыре камня.

Игрок, забравший последний камень выигрывает. В начальный момент
в куче было S камней, 1 ≤ S ≤ 15.

Известно, что Ваня выиграл своим первым ходом после неудачного
первого хода Пети. Укажите максимальное значение S, когда такая
ситуация возможна.
"""
