"""
Для кодирования некоторой последовательности, состоящей из букв
Л, М, Н, П, Р, решили использовать неравномерный двоичный код,
удовлетворяющий условию, что никакое кодовое слово не является
началом другого кодового слова. Это условие обеспечивает
возможность однозначной расшифровки закодированных сообщений.
Для букв Л, М, Н использовали соответственно кодовые слова 00, 01, 11.
Для двух оставшихся букв – П и Р – кодовые слова неизвестны.
Укажите кратчайшее возможное кодовое слово для буквы П, при котором
код будет удовлетворять указанному условию. Если таких кодов несколько,
укажите код с наименьшим числовым значением.
"""