"""
По каналу связи передаются сообщения, содержащие только десять букв:
А, Б, В, Г, Д, Е, И, К, Л, М. Для передачи используется двоичный код,
удовлетворяющий условию Фано. Кодовые слова для некоторых букв известны:

А --   00,
Б --  111,
В --  010,
Г -- 1100,
Д -- 1010,
Е --  011,
И -- 1011,
К -- 1000,
Л --    ?,
М -- 1001.

Укажите кратчайшее кодовое слово для буквы Л. Если таких кодов
несколько, укажите код с наименьшим числовым значением.

Примечание: условие Фано означает, что ни одно кодовое слово
не является началом другого кодового слова.
"""