"""
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками
лежит куча камней. Игроки ходят по очереди, первый ход делает Петя.
За один ход игрок может

а) добавить в кучу один камень;
б) добавить в кучу два камня;
в) добавить в кучу три камня.

Игра завершается в тот момент, когда количество камней в
куче превышает 20. Победителем считается игрок, сделавший
последний ход, то есть первым получивший кучу, в которой
будет 21 или больше камней. В начальный момент в куче было
S камней, 1 ≤ S ≤ 20.

Известно, что Ваня может гарантированно выиграть своим первым
ходом. Укажите значение S, с которого началась игра.
"""
