"""
Дана последовательность целых чисел.

Необходимо найти максимально возможную сумму
её непрерывной подпоследовательности,
в которой количество положительных чётных элементов кратно k = 30

Входные данные

Первая строка входного файла содержит целое число
N – общее количество чисел в наборе.
Каждая из следующих N строк содержит одно число.

Гарантируется, что общая сумма любой выборки заданных чисел
не превышает 2 ∙ 10⁹ по абсолютной величине.

Вам даны два входных файла (A и B),
каждый из которых имеет описанную выше структуру.

В ответе укажите два числа:
сначала значение искомой суммы для файла A,
затем для файла B.
"""