"""
На вход программы поступает последовательность
из N целых положительных чисел.
Рассматриваются все пары различных элементов последовательности,
находящихся на расстоянии кратном 5
(разница в индексах элементов пары должна быть кратна 5,
порядок элементов в паре неважен).

Необходимо определить минимальную сумму пары, кратную 107.

Описание входных и выходных данных

В первой строке входных данных задаётся количество чисел N.
В каждой из последующих N строк записано одно целое положительное число,
не превышающее 100 000.

Программа должна вывести минимальную сумму пары, удовлетворяющую условиям.

Пример входных данных:
10
1
6
3
100
6
6
208
11
7
15

Пример выходных данных для приведённого выше примера входных данных: 107
"""