"""
На вход программы поступает последовательность
из N целых положительных чисел.
Рассматриваются все пары различных элементов последовательности.

Необходимо определить количество пар чисел,
находящихся на расстоянии не менее чем 6
(разница в индексах элементов пары должна быть 6 или более,
порядок элементов в паре неважен),
разность которых кратна 13, а произведение чётно.

Описание входных и выходных данных

В первой строке входных данных задаётся количество чисел N.
В каждой из последующих N строк записано одно целое положительное число,
не превышающее 100 000.

Программа должна вывести в первой строке одно число:
количество пар чисел, удовлетворяющих условию.

Пример входных данных:
7
55
28
15
2
42
27
16

Пример выходных данных для приведённого выше примера входных данных:1
"""