"""
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками
лежит куча, состоящая из S конфет. Игроки ходят по очереди, первый
ход делает Петя. За один ход игрок может съесть не более пяти, но не
менее одной конфеты или съесть половину конфет, если число конфет
четное. Съесть можно только целое количество конфет. Игра завершается
в тот момент, когда в куче останется менее десяти конфет. Победителем
считается игрок, который сделал последний ход.

Укажите значение S, при котором Ваня выиграет первым ходом при любой
игре Пети.
"""
