"""
При регистрации в компьютерной системе каждому объекту
присваивается идентификатор, состоящий из 86 символов и
содержащий только символы из 250-символьного алфавита.
В базе данных для хранения сведений о каждом идентификаторе
отведено одинаковое и минимально возможное целое число байт.
При этом используют посимвольное кодирование идентификаторов,
все символы кодируют одинаковым и минимально возможным
количеством бит.

Определите объём памяти (в байтах), необходимый для хранения
256 идентификаторов.

В ответе запишите только целое число — количество байт.
"""
