"""
При регистрации в компьютерной системе каждому объекту
присваивается идентификатор, состоящий из 80 символов.
В базе данных для хранения сведений о каждом идентификаторе
отведено одинаковое и минимально возможное целое число байт.
При этом используют посимвольное кодирование идентификаторов,
все символы кодируют одинаковым и минимально возможным
количеством бит.

Определите максимальное количество символов, которое может
быть использовано для формирования идентификатора
(мощность алфавита), если известно, что информация о 1200
идентификаторах занимает не более 150 Кбайт.
"""
