"""
При регистрации в компьютерной системе каждому пользователю
выдаётся пароль, состоящий из 20 символов и содержащий только
арабские цифры 0, 1 и буквы A, B, C, D, E, F, G. В базе данных
для хранения сведений о каждом пользователе отведено одинаковое
и минимально возможное целое число байт. При этом используют
посимвольное кодирование паролей, все символы кодируют
одинаковым и минимально возможным количеством бит. Кроме
собственно пароля, для каждого пользователя в системе хранится
IP-адрес пользователя (4 байта) и дополнительные сведения,
для чего выделено целое число байт; это число одно и то же
для всех пользователей. Для хранения сведений о 192 пользователях
потребовалось 6 Кбайт.

Сколько байт выделено для хранения дополнительных сведений
об одном пользователе? В ответе запишите только целое
число - количество байт.
"""
