"""
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками
лежит две кучи камней. Игроки ходят по очереди, первый ход делает
Петя. За один ход игрок может добавить в любую кучу один камень
или добавить в любую кучу столько камней, сколько их в данный
момент в другой куче. Игра завершается в тот момент, когда общее
количество камней в двух кучах становится не менее 68. В начальный
момент в первой куче было 8 камней, а во второй – S камней, 1 ≤ S ≤ 59.

Известно, что Ваня выиграл своим первым ходом после неудачного
первого хода Пети. Назовите минимальное значение S, при котором
это возможно.
"""
