"""
Музыкальный фрагмент был оцифрован и записан в виде файла без
использования сжатия данных. Получившийся файл был передан в
город А по каналу связи за 100 секунд. Затем тот же музыкальный
фрагмент был оцифрован повторно с разрешением в 3 раза выше и
частотой дискретизации в 4 раз меньше, чем в первый раз.
Сжатие данных не производилось. Полученный файл был передан
в город Б за 15 секунд. Во сколько раз пропускная способность
канала в город Б больше пропускной способности канала в город А?
"""
