"""
У Толи есть доступ к сети Интернет по высокоскоростному
одностороннему радиоканалу, обеспечивающему скорость получения
информации 220 бит в секунду. У Миши нет скоростного доступа
в Интернет, но есть возможность получать информацию от Толи
по низкоскоростному телефонному каналу со средней скоростью
213 бит в секунду. Миша договорился с Толей, что тот будет
скачивать для него данные объемом 10 Мбайт по высокоскоростному
каналу и ретранслировать их Мише по низкоскоростному каналу.
Компьютер Толи может начать ретрансляцию данных не раньше,
чем им будут получены первые 1024 Кбайт этих данных.
Каков минимально возможный промежуток времени (в секундах)
с момента начала скачивания Толей данных до полного их получения
Мишей? В ответе укажите только число, слово «секунд» или букву «с»
добавлять не нужно.
"""
