"""
Петя имеет доступ к высокоскоростному каналу передачи данных со
скоростью 224 бит/сек, Вася имеет доступ только к каналу связи с
Петей со скоростью 220 бит/сек. Известно, что Васе необходимо
скачать файл, размером 4 Мбайт. Для этого Петя и Вася договорились,
что Петя скачает файл к себе на компьютер, после чего предоставит
доступ к файлу Васе и Вася загрузит файл на свой компьютер.

Сколько секунд займет процесс от начала скачивания файла Петей
до полного его получения Васей, если предположить, что Вася начнет
скачивать файл сразу же, после его полной загрузки Петей?
"""
