"""
Стоит задача передать файл размером 500 Мбайт между компьютерами
в одной локальной сети.

При этом есть два способа:

А) записать файл на USB-накопитель, перенести физически
   накопитель до приемника, выгрузить файл,

Б) передать по локальной сети со скоростью 10 Мбит/сек.

Известно, что скорость записи и чтения файла через USB
составляет 100 Мбит/сек. На перемещение USB-накопителя
понадобится 40 секунд.

Какой способ быстрее и на сколько? В ответе запишите
сначала букву А или Б – вариант, с помощью которого файл
получится передать быстрее, и число – разницу в секундах
между этими двумя способами. Разделители между буквой и
числом указывать не нужно.
"""
