"""
На вход программы поступает последовательность
из N натуральных чисел (6 ≤ N ≤ 10000).

Необходимо определить минимальную сумму двух элементов,
кратную 23, при этом произведение этих чисел должно делиться на 6,
а расстояние между двумя элементами не менее 7.

Описание входных и выходных данных

В первой строке входных данных задается количество чисел N.
В каждой из последующих N строк записано одно натуральное число,
не превосходящее 100 000.

Программа должна вывести одно число –
минимальную сумму удовлетворяющую условию.

Пример входных данных:
12
97
84
35
96
90
43
77
71
37
72
3
42

Пример выходных данных для приведенного выше примера входных данных: 138
"""