"""
Некий исполнитель умеет строить лесенки. Каждая ступенька
такой лесенки имеет одну единицу по высоте и положительное
целое количество единиц в длину. Одна из возможных лесенок
показана на рисунке.

Исполнитель умеет выполнять команды ВВЕРХ и ВПРАВО N, где
N – длина ступеньки, причем алгоритм всегда начинается
командой ВВЕРХ и заканчивается командой ВПРАВО. Необходимо,
выполнив 8 команд, построить лесенку из четырех ступенек,
ведущую из точки А в точку В. Точка А имеет координаты
(0,0) на координатной плоскости, а точка В – координаты
(5,4). Сколько различных последовательностей команд
могут привести к требуемому результату?
"""
4