"""
В магазине Пятэльдодео на черную пятницу решено провести одну
из двух акций.

Первая акция – 30% скидки на 70% самых дешевых товаров, 40% процентов
скидки на оставшиеся товары.

Вторая акция – 40% скидки на 50% самых дешевых товаров, 35% процентов
скидки на оставшиеся товары.

Определить, какая акция принесет больше выручки, если предположить,
что все товары будут проданы.

В качестве ответа привести разницу в выручке двух акций, а также
стоимость самого дорого товара с учётом скидки при проведении наиболее
выгодного варианта. В ответе запишите целую часть полученных чисел.

Входные данные.
В первой строке входного файла находится число N – количество
товаров кратное 20 (натуральное число, 20 ≤ N ≤ 10000). В следующих
N строках находятся значения – стоимость товаров (целое число не
большее 1000).

Пример входного файла (все значения с новой строки):

20
4 13 4 23 22 20 8 6 5 12 48 22 50 12 63 23 4 8 9 11

При таких исходных данных ответ должен содержать 2 числа – 1 и 40.
"""
