"""
На вход программы поступает последовательность из N натуральных чисел.
Рассматриваются все пары различных элементов последовательности
(элементы пары не обязательно должны стоять в последовательности рядом,
порядок в паре неважен).

Необходимо определить количество пар,
для которых произведение элементов заканчивается на 3,
а номера чисел в последовательности отличаются не менее, чем на 6.

Описание входных и выходных данных

В первой строке входных данных задается количество чисел N.
В каждой из последующих N строк записано одно целое положительное число,
не превышающее 100 000.

В качестве ответа программа должна вывести одно число:
количество пар, в которых произведение элементов заканчивается на 3,
а номера чисел в последовательности отличаются не менее, чем на 6.

Пример входных данных:
10
17
11
15
24
36
47
13
9
44
53

Пример выходных данных для приведенного выше примера входных данных:2
"""