"""
Дана последовательность целых чисел.
Рассматриваются все её непрерывные подпоследовательности
длиной не менее семи элементов,
такие что количество положительных чисел кратных 7 делится на 7.

Найдите наибольшую сумму такой подпоследовательности.

Входные данные

Первая строка входного файла содержит целое число
N – общее количество чисел в наборе.
Каждая из следующих N строк содержит одно число.

Гарантируется, что общая сумма любой выборки заданных чисел
не превышает 2 ∙ 10⁹ по абсолютной величине.

Вам даны два входных файла (A и B),
каждый из которых имеет описанную выше структуру.
В ответе укажите два числа:
сначала значение искомой суммы для файла A,
затем для файла B.
"""