"""
Текстовый файл состоит из символов R, S и Q. В прилагаемом
файле определите максимальное количество символов в непрерывной
подпоследовательности, состоящей из идущих подряд групп символов
RSQ в указанном порядке. При этом в начале и в конце искомой
последовательности группа символов RSQ может быть неполной.

Искомая подпоследовательность должна содержать не менее одной
полной группы символов RSQ.

Например, условию задачи удовлетворяют: SQRSQRSQR; QRSQRS и т.п.

Для выполнения этого задания следует написать программу.
"""
