"""
Дана последовательность N целых положительных чисел.

Необходимо определить количество пар элементов этой последовательности,
сумма которых не более m=134,
при этом первый элемент пары должен быть больше второго
(a[i] > a[j], i < j).

Входные данные:

В первой строке записано натуральное число N –
количество чисел в последовательности.
В следующих N cтроках записаны числа,
входящие в последовательность, по одному в каждой строке.

Выходные данные:

Программа должна вывести одно число – количество найденных пар.

Пример входных данных:
6
132
1
116
7
22
26

Пример выходных данных для приведённого примера входных данных: 2
"""