"""
Пусть S - сумма различных натуральных делителей целого числа,
являющихся простыми числами, не считая самого числа.

Напишите программу, которая перебирает целые числа,
меньшие 500 000, в порядке убывания и ищет среди них такие,
для которых значение S не равно нулю и делится на 10.
Программа должна найти и вывести первые 7 таких чисел
и соответствующие им значения S.

формат вывода: для каждого из 7 таких найденных чисел
в отдельной строке сначала выводится само число, затем значение S.
Строки выводятся в порядке убывания найденных чисел.

Например, для числа 20 S = 2 + 5 =7
"""
