"""
Назовём нетривиальным делителем натурального числа его делитель,
не равный единице и самому числу.

Найдите все натуральные числа,
принадлежащие отрезку [106732567; 152673836]
и имеющие ровно три нетривиальных делителя.
Для каждого найденного числа запишите в ответе само число
и его наибольший нетривиальный делитель.
Найденные числа расположите в порядке возрастания.

Например, для числа 2018 имеем следующие делители 2 и 1009.
Поэтому результатом (не принимая во внимание количества делителей)
будет пара чисел

2018 1009
"""
