"""
Пусть S -
сумма натуральных чётных делителей целого числа, не считая самого числа.
Если таких делителей у числа нет, то считаем значение S равным нулю.

Напишите программу,
которая перебирает целые числа из отрезка [1204300; 1204380]
в порядке возрастания
и ищет среди них такие,
для которых значение S не равно нулю и кратно 10.

Программа должна найти и вывести такие числа
и соответствующие им значения S.

Формат вывода: для каждого из найденных чисел в отдельной строке
сначала выводится само число, затем значение S.
Строки выводятся в порядке возрастания найденных чисел.
"""
