"""
Определите, сколько символов * выведет эта процедура при вызове F(40):

def F(n):
   print('*')
   if n>=1:
      print('*')
      F(n-1)
      F(n-3)
      print('*')
"""
