"""
При регистрации в компьютерной системе каждому 
пользователю выдаётся пароль, состоящий из 8 символов 
и содержащий только символы из 7-символьного набора: 
P, A, S, W, O, R, D. В базе данных для хранения каждого 
пароля отведено одинаковое и минимально возможное целое 
число байт. При этом используют посимвольное кодирование 
паролей, все символы кодируют одинаковым и минимально 
возможным количеством бит. Кроме собственно пароля, для 
каждого пользователя в системе хранятся дополнительные 
сведения, для чего отведено 8 байт на одного пользователя.

Определите объём памяти (в байтах), необходимый для хранения 
данных о 42 пользователях. В ответе запишите только целое 
число — количество байт.
"""
