"""
В файле содержится последовательность целых чисел. Элементы 
последовательности могут принимать целые значения от 
-100 000 до 100 000 включительно. Определите количество 
пар последовательности, в которых сумма цифр только одного 
из элементов кратна 5, а модуль разности квадратов элементов 
пары не меньше куба максимального элемента последовательности, 
являющегося трёхзначным числом.

В ответе запишите количество найденных пар чисел, затем 
максимальную из сумм элементов таких пар.

В данной задаче под парой подразумевается два идущих подряд 
элемента последовательности.
"""
