"""
По каналу связи передается сообщения, содержащие только 
восемь букв:  Й, К. Для передачи используется
двоичный код, удовлетворяющий условию Фано.

Кодовые слова для некоторых букв известны:

Д   0101
И   111
О   110 
Р   0100
У   011
Я   1011

Какое наименьшее количество двоичных знаков потребуется 
для кодирования слова «КОДИРУЙ»?

Примечание. Условие Фано означает, что никакое кодовое 
слово не является началом другого кодового слова. Это 
обеспечивает возможность однозначной расшифровки 
закодированных сообщений.
"""
