"""
По каналу связи передаются сообщения, содержащие только буквы: С, Р, К, О, В,
Д, Е. Для передачи используется двоичный код, удовлетворяющий условию Фано.
Это условие обеспечивает возможность однозначной расшифровки закодированных
сообщений. Кодовые слова для некоторых букв известны: К – 00, Р – 010, В –
0110, Д – 10.

Для оставшихся букв С, О и Е кодовые слова неизвестны. Какое **наименьшее**
количество двоичных знаков требуется для кодирования слова КРОССВОРД?

Примечание. Условие Фано означает, что никакое кодовое слово не является
началом другого кодового слова.

Это обеспечивает возможность однозначной расшифровки закодированных сообщений.
"""

