"""
В терминологии сетей TCP/IP маской сети называют двоичное число,
которое показывает, какая часть IP-адреса узла сети относится
к адресу сети, а какая - к адресу узла в этой сети. Адрес сети
получается в результате применения поразрядной конъюнкции к
заданному адресу узла и маске сети.

Два узла, находящиеся в разных подсетях, имеют IP-адреса
10.96.180.231 и 10.96.140.118. В масках обеих подсетей
одинаковое количество единиц. Найдите наибольшее возможное
количество нулей в двоичной записи маски подсети.
"""
