"""
В терминологии сетей TCP/IP маской сети называют двоичное число,
которое показывает, какая часть IP-адреса узла сети относится к адресу
сети, а какая - к адресу узла в этой сети. Адрес сети получается в
результате применения поразрядной конъюнкции к заданному адресу
узла и маске сети.

Сеть задана IP-адресом 192.168.240.0 и маской сети 255.255.255.0
Сколько в этой сети IP-адресов, для которых количество единиц и
нулей в двоичной записи IP-адреса одинаково?

В ответе укажите только число.
"""
8
