"""
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками
лежит три кучи камней. Игроки ходят по очереди, первый ход делает
Петя. За один ход игрок может добавить в одну из куч 3, 13 или 23 камня.
Игра завершается в тот момент, когда в сумме в кучах будет не менее
73 камней. Победителем считается игрок, сделавший последний ход.
В начальный момент в кучах было (2, S, 2S) камней, 1 ≤ S ≤ 23.

При некотором значении S Ваня одержал победу свои первым ходом
после неудачного хода Пети. Укажите минимальное значение S, при
котором это возможно.
"""
