"""
На вход программе подается последовательность натуральных чисел.
Особым числом называется число, делящееся на 3.
Рассматриваются все непрерывные подпоследовательности
исходной последовательности, содержащие ровно 10 особых чисел.

Программа должна вывести одно число –
минимальную сумму элементов такой подпоследовательности.

Входные данные. Даны два входных файла,
каждый из которых содержит в первой строке количество чисел
N (100 ≤ N ≤ 5000000).
Каждая из следующих N строк файлов содержит одно целое число,
не превышающее 10000.

Гарантируется, что сумма любой подпоследовательности
исходной последовательности не превышает 10⁹.

В ответе укажите два числа:
сначала искомое значение для файла А,
затем для файла B.
"""