"""
На вход программы поступает последовательность
из N целых положительных чисел.
Рассматриваются все пары различных элементов последовательности.

Необходимо определить максимальную сумму двух чисел,
заканчивающуюся на 12.
При этом первое число в паре (которое вводилось раньше)
должно быть больше второго числа (которое вводилось позже).

Описание входных и выходных данных

В первой строке входных данных задаётся количество чисел N.
В каждой из последующих N строк записано одно целое положительное число,
не превышающее 100 000.

Программа должна вывести в одно число:
максимальную сумму двух чисел, заканчивающуюся на 12,
при этом предыдущее по вводу число должно быть больше текущего.

Пример входных данных:
7
276
18
136
14
198
7
13

Пример выходных данных для приведённого выше примера входных данных: 412
"""