"""
Организация купила для своих сотрудников все места в нескольких
подряд идущих рядах на концертной площадке. Известно, какие места
уже распределены между сотрудниками. Найдите ряд с наибольшим номером,
в котором наибольшее количеством подряд идущих мест, таких что все
они уже распределены (заняты). В ответе запишите два целых числа:
номер ряда и наибольшее количество подряд занятых мест.

Входные данные представлены в файле следующим образом. В первой строке
входного файла находится одно число: N – количество занятых мест
(натуральное число, не превышающее 10 000). В следующих N строках
находятся пары чисел: ряд и место выкупленного билета, не превышающие
100000. В ответе запишите два целых числа: номер ряда и наибольшее
количество подряд занятых мест.

Пример входного файла:

10
5 5
5 6
5 7
16 9
16 3
16 6
20 23
20 28
20 29
20 30

В данном примере максимальное количество подряд идущих занятых
мест равно 3 (5 ряд места 5, 6, 7 и 20 ряд места 28, 29,30).
Ответом будет пара чисел 20 3.
"""
