"""
При регистрации в компьютерной системе каждому объекту присваивается
идентификатор, содержащий только десятичные цифры и буквы латинского
алфавита в произвольном регистре (т. е. буквы могут быть как прописные,
так и строчные).

В базе данных для хранения каждого идентификатора отведено
одинаковое и минимально возможное целое число байт. При этом
используется посимвольное кодирование идентификаторов, все
символы кодируются одинаковым и минимально возможным
количеством бит.

Для хранения 1000 идентификаторов отведено 10 Кбайт. Определите
максимально возможную длину идентификатора.
В ответе запишите целое число.
Примечание. В латинском алфавите 26 букв.
"""
