"""
По каналу связи передаются сообщения, содержащие только
семь букв: И, Н, Т, Е, Л, К и Г. Для передачи используется
двоичный код, удовлетворяющий условию Фано.

Кодовые слова для некоторых букв известны: Л — 100, Н — 110.

Какое количество двоичных знаков потребуется для кодирования
слова ИНТЕЛЛЕКТ, если известно, что оно закодировано минимально
возможным количеством двоичных знаков?

Примечание. Условие Фано означает, что никакое кодовое слово не
является началом другого кодового слова. Это обеспечивает возможность
однозначной расшифровки закодированных сообщений.
"""
