"""
При регистрации в компьютерной системе каждому объекту 
присваивается идентификатор, состоящий из 42 символов и 
содержащий только символы из специального алфавита. В базе 
данных для хранения каждого идентификатора отведено одинаковое и 
минимально возможное целое число байт. При этом используется 
посимвольное кодирование идентификаторов, все символы 
кодируются одинаковым и минимально возможным количеством бит.

Для хранения 4000 идентификаторов выделен объём памяти 800 Кбайт. 
Определите наибольшее возможное количество символов в алфавите.

В ответе запишите только целое число — количество символов в алфавите.
"""
