"""
Операнды арифметического выражения записаны в системе счисления 
с основанием 14.

14y5x2 + 31x2y3

В записи чисел переменными x,y обозначены неизвестные цифры из 
алфавита 14-ричной системы счисления.

Определите такие значения переменных x и y, при которых значение 
данного арифметического выражения кратно 9, а их сумма максимальна. 
Если таких вариантов окажется несколько, выберите вариант с наибольшим 
значением переменной x.

Для найденных значений x и y вычислите частное от деления значения 
арифметического выражения на 9 и укажите его в ответе в десятичной 
системе счисления. Основание системы счисления указывать не нужно.
"""
