"""
В файле содержится последовательность натуральных чисел, 
каждое из которых не превышает 100 000. Определите количество
пар элементов последовательности, в которых сумма элементов 
пары меньше квадрата второго минимального трёхзначного элемента 
последовательности. Гарантируется, что в последовательности есть 
хотя бы два трёхзначных числа.

В ответе запишите количество найденных пар чисел, затем максимальную 
из сумм элементов таких пар.

В данной задаче под парой подразумеваются два идущих подряд 
элемента последовательности.
"""
