"""
Антон заполнял таблицу истинности логической функции F: 
((a∧b)→c)∧((b∧c)→d), но успел заполнить лишь фрагмент из четырёх 
различных её строк, даже не указав, какому столбцу таблицы соответствует 
каждая из переменных a,b,c,d:

?   ?   ?   ?   F
    1   1   1   0
    1       1   0
1   1   1       0
    1   1       0

Определите, какому столбцу таблицы соответствует каждая из 
переменных a,b,c,d.

В ответе напишите буквы a,b,c,d в том порядке, в котором идут 
соответствующие им столбцы (сначала буква, соответствующая 
первому столбцу, затем буква, соответствующая второму столбцу, 
и т. д.). Буквы в ответе пишите подряд, никаких разделителей 
между буквами ставить не нужно.
"""
