"""
Исполнитель преобразует число на экране. У исполнителя есть 
три команды, которым присвоены номера:

- Прибавь 3
- Умножь на 2
- Умножь на 5

Первая из них увеличивает число на экране на 3, вторая 
увеличивает число на экране в два раза, третья увеличивает 
число на экране в пять раз.

Программа для исполнителя — это последовательность команд.

Сколько существует программ, для которых при исходном числе 5 
результатом является число 115 и которые не содержат число 25?

Траектория вычислений программы — это последовательность 
результатов выполнения всех команд программы. Например, 
для программы 123 при исходном числе 3 траектория будет 
состоять из чисел 6, 12, 60.
"""
