"""
Пусть K — сумма минимального и максимального натуральных 
делителей целого числа, не считая единицы и самого числа. 
Если таких делителей у числа нет, то считаем значение 
K равным нулю.

Напишите программу, которая перебирает целые числа больше 
650 000 в порядке возрастания и ищет среди них числа, 
подходящие под условия:

- число имеет ровно 6 различных делителей, не считая 
  единицы и самого числа
- значение K для числа имеет 4 цифры в записи

Выведите первые 5 найденных чисел и соответствующие им 
значения K.

Формат вывода: для каждого из 5 таких найденных чисел в 
отдельной строке сначала выводится само число, затем — 
значение K.

Строки выводятся в порядке убывания найденных чисел.
"""
