"""
По каналу связи передаются сообщения, содержащие только 
восемь букв: А, Б, В, Г, Д, Е, Ж, З. Для передачи используется 
двоичный код, удовлетворяющий условию Фано.

Кодовые слова для некоторых букв известны:

А 110
В 01
Г 1010
Ж 000
З 111

Какое кодовое слово у буквы Б, если известно, что его длина 
равна 4 и в нём ровно 3 единицы? В ответе запишите это кодовое слово.

Примечание. Условие Фано означает, что никакое кодовое слово не 
является началом другого кодового слова. Это обеспечивает возможность 
однозначной расшифровки закодированных сообщений.
"""
