"""
У Лены есть доступ к Интернету по высокоскоростному одностороннему 
радиоканалу, обеспечивающему скорость получения им информации 2^23 бит 
в секунду. У Вари нет скоростного доступа в Интернет, но есть возможность 
получать информацию от Лены по низкоскоростному телефонному каналу 
со средней скоростью 2^11 бит в секунду. Варя договорилась с Леной, 
что Лена будет скачивать для неё данные объемом 20 Мбайт по 
высокоскоростному каналу и ретранслировать их Варе по 
низкоскоростному каналу. Компьютер Лены может начать 
ретрансляцию данных не раньше, чем будут получены 
первый 1 Мбайт этих данных.

Каков минимально возможный промежуток времени (в секундах) с 
момента начала скачивания Леной данных до полного их получения Варей?

В ответе укажите только число, слово «секунд» или букву «с» 
добавлять не нужно.
"""
