"""
Дана последовательность натуральных чисел.

Необходимо определить количество её непрерывных подпоследовательностей,
сумма элементов которых кратна 666.

Входные данные

Первая строка входного файла содержит целое число
N – общее количество чисел в наборе.
Каждая из следующих N строк содержит одно число.

Гарантируется, что общая сумма всех чисел
и число в ответе не превышают 2 ∙ 10⁹.

Вам даны два входных файла (A и B),
каждый из которых имеет описанную выше структуру.

В ответе укажите два числа:
сначала искомое количество для файла A,
затем – для файла B.
"""