"""
На вход алгоритма подаётся натуральное число N.
Алгоритм строит по нему новое число R следующим образом.

1. Строится шестеричная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
    а) если число N делится на 3, то к этой записи дописываются
       две первые шестеричные цифры;
    б) если число N на 3 не делится, то остаток от деления на
       3 умножается на 10, переводится в шестеричную запись и
       дописывается в конец числа.
   Полученная таким образом запись является шестеричной записью
   искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.

Например, для исходного числа 11 результатом является число 416,
а для исходного числа 12 это число 444.

Укажите минимальное число R, большее 680, которое может
быть получено с помощью описанного алгоритма. В ответе
запишите это число в десятичной системе счисления.
"""