"""
На вход алгоритма подаётся натуральное число N.
Алгоритм строит по нему новое число R следующим образом.

1) Строится двоичная запись числа N.
2) К этой записи дописывается (дублируется) последняя цифра.
3) Затем справа дописывается бит чётности: 0, если в двоичном
   коде полученного числа чётное число единиц, и 1, если нечётное.
4) К полученному результату дописывается ещё один бит чётности.

Полученная таким образом запись (в ней на три разряда больше,
чем в записи исходного числа N) является двоичной записью искомого
числа R. Укажите минимальное число N, после обработки которого
автомат получает число, большее 130. В ответе это число
запишите в десятичной системе.
"""
for n in range(1, 100):
    b = bin(n)[2:]
    b+=b[-1]
    for i in range(2):
        b+='0' if b.count('1') % 2 == 0 else '0'
    if int(b, 2) > 130: print(n)